 # 2) ჩამოწერეთ Set-ის ძირითადი განმასხვავებელი თვისებები.
# setar inaxavs duplicate elementebs

# 3) ასევე ჩამოწერეთ ყველა set-ის ფუნქცია რაც განვიხილეთ და თითოეულზე მოიყვანეთ მინ. 1 მაგალითი.
# 1 - .add()
# 2 - .remove()
# 3 - .clear()
# 4 - .union()
# 5 - .differance()


# 4) შექმენით set, სადაც დაამატებთ 10 რიცხვს, აქედან 3 რიცხვი დუპლიკატი უნდა იყოს. დაბეჭდეთ set ტერმინალში და დააკვირდით შედეგს.
nums = {1, 1, 1, 33, 56, 67, 94, 54, 834, 8374}
print(nums)
# 5) შექმენით Array, სადაც რამდენიმე ციფრი მეორდება: [1, 2, 2, 3, 4, 4, 5]. გადააქციეთ ეს მასივი Set-ად, რათა ავტომატურად წაიშალოს დუბლიკატები და შედეგი გამოიტანეთ ტერმინალში.
nums1 = [1, 1, 1, 33, 56, 67, 94, 54, 834, 8374]
nums1 = (set(nums1))
nums1 = (list(nums1))
print(nums1)

# 6) შექმენით თქვენი საყვარელი წიგნების ან ფილმების სეტი. გამოიყენეთ შესაბამისი თვისება , რათა გაიგოთ რამდენი ელემენტია სეტში და დაბეჭდეთ ეს რიცხვი.
films = {"The Hunger Games" , "The Hunger Games: Catching Fire" , "The Hunger Games: Mockingjay – Part 1" , "The Hunger Games: Mockingjay – Part 2	"}
count = len(films)
print(count)

# 7) შექმენით კვირის დღეების სეტი (მაგ: 'Monday', 'Tuesday', 'Wednesday'). for ციკლის გამოყენებით სათითაოდ დაბეჭდეთ ტერმინალში თითოეული დღე ასეთი ფორმატით: "დღე: Monday".
week_days = {'Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday'}
for i in week_days:
   print(f"დღე: {week_days}")
# 8) შექმენით ცვლადები:
# football_players = {'დათო', 'ნიკა', 'ლუკა', 'ლიკა'}
# basketball_players = {'ანი', 'ლუკა', 'მარიამი', 'ნიკა'}
# გამოიყენეთ .union() მეთოდი, რათა გააერთიანოთ ეს ორი სეტი და გაიგოთ სულ რამდენი უნიკალური მოსწავლე დადის სპორტზე. შედეგი დაბეჭდეთ.
football_players = {'დათო', 'ნიკა', 'ლუკა', 'ლიკა'}
basketball_players = {'ანი', 'ლუკა', 'მარიამი', 'ნიკა'}
print(football_players.union(basketball_players))

# 9) შექმენით ორი სეტი: თქვენი სამომავლო გეგმების (ყველა ტექნოლოგია, რისი სწავლაც გინდათ, wishlist ცვლადი) და უკვე შესწავლილი ტექნოლოგიების (learned).
# .difference() მეთოდის გამოყენებით გაიგეთ, რომელი ტექნოლოგიები დაგრჩათ სასწავლი (ანუ არის wishlist-ში, მაგრამ არ არის learned-ში).
wishlist = {"HTML" , "Css" , "JavaScript", "Py" , "React"}
learned = {"HTML", "Css", "Py"}
print(wishlist.difference(learned))
# 10) წარმოიდგინეთ, გაქვთ ონლაინ მაღაზიის კალათა, სადაც მომხმარებელმა დაამატა ნივთების ID-ები:
#  cart = {101, 204, 305}. მომხმარებელმა დააჭირა ღილაკს „კალათის გასუფთავება“. გამოიყენეთ შესაბამისი მეთოდი,
#  გაასუფთავეთ სეტი და დაბეჭდეთ შედეგი.
cart = {101, 204, 305}
print(cart.clear)