# lvl 35 - გაკვეთილზე ჩართვას როდესაც ვერ ვახერხებ და ჩართვას ვერ ვახერხებ ჩანაწეს ვუყურებ ხოლმე
#          და საკლასო დავალებას არ ვწერ(მავიწყდება ხშირ შემთხვევაში და გამოვასწორებ აუცილებლად). 
#          საშინაო დავალება გაკეთებული მაქვს, შეიძლება ატვირთვაშია პრობლემა და ამასაც აუცილებლად ამოვასწორებ.

# lvl 36 - ჩაგვიტარდა kahooti და არც საკლასო და არც საშინაო დავალება არ მოუცია მასწავლებელს
# (ახალ დავალებას არ გაძლევთ. შემდეგი გაკვეთილისთვის მზად გქონდეთ Level 34-ის დავალება.)

# lvl 37 - homewoork_ის ფაილში არ მქონდა დავალება შენახული. გამოვასწორე და თავიდან ავტვირთე.

# lvl 38 - საშინაოში 5/5 დავალება მაქვს გაკეთებული. შეიძლება ატვირთვის ან დაკომენტარების შეცდომაა. ვექცდები გამოვასწორო აუცილებლად

# lvl 39 - ფაილები ყიო არეული დავაეგე და თავიდან ავტვირთავ.

# lvl 40 - არასწორად მქონდა ატვირთული, თავიდან ავტვირთავ.

# lvl 44 - ჯგუფურ პროექტებზე უნდა გავვეყყო მუშაობა.
#          (lvl44 ში საკლასოშიც და საშინაოშიც codewars ები იყ გასაკეთებელი, ამის ფოტოებსაც ავტვირთავ ან თქვენ ცაგიგდებთ)

# lvl 45 - homewoork გაკეთებული მაქვს უბრალოდ ასატვირთია.

# lvl 46 - არ გვქონდა დავალება(
#          ახალ დავალებას არ გაძლევთ, რადგან ჩავიბარე ჯგუფური პროექტები. აუცილებლად შეასრულეთ წინა დავალებები.)
           
# lvl 47 - საკლასო მიწერია, საშინაო არა. დავწერ და ავტვირთავ აუცილებლად

# lvl48 , lvl49 -ფიზიკურად ვერ მოვახერხე გაკვეთილზე ჩართვა, სღვადგენ და საკლასო-საშინაო დავალებებსაც ავტვირთავ

# gasaketebeli darcha : code wars, lvl47 48 47, sayurebeli(lvl48 da 49)