// lvl 57
// 'example string'.methodName()
// toUpperCase - გადაიყვანს სტრინგს uppercase-ად
// toLowerCase - გადაიყვანს სტრინგს lowercase-ად
// startsWith - ამოწმებს იწყება თუ არა სტრინგი კონკრეტულ ასოზე/ასოებზე
// endsWith - ამოწმებს მთავრდება თუ არა სტრინგი კონკრეტულ ასოზე/ასოებზე
// trim - სტრინგს ასუფთავებს ზედმეტი space-ებისგან. (მარცხნიდან და მარჯვნიდან)
// ++ ---> Increment operator. (ერთით ზრდის მნიშვნელობას)
// -- ---> decrement operator. (ერთით ამცირებს მნიშვნელობას)

// lvlv 60
// .length - კუთვნილება, რომელსაც გამოაქვს მასივის სიგრძე
// .push() - მეთოდი, რომელიც მასივის ბოლოში ამატებს ელემენტს.
// .pop() - მეთოდი, რომელიც მასივის ბოლოდან შლის ელემენტს. (არგუმენტები არ გადაეცემა)
// .at() - აბრუნებს კონკრეტულ ინდექსზე რომელი ელემენტი იმყოფება
// .concat() - აერთებს სტრინგებს / აერთიანებს მასივებს
// .shift() - სიიდან შლის პირველ ელემენტს
// .unshift() - სიის პირველ პოზიციაზე ამატებს ელემენტს
// .slice() - სიის მონაკვეთს ამოჭრის (original სიაბ არ იცვლება). (start index, stop index). ყოველთვის ბოლო ინდექსამდე მოიჭრება.
// .indexOf() - აბრუნებს არგუმენტად გადაცემული ელემენტის ინდექსს მასივში.
