info = {
    "name" : "Messi",
    "country" : "Argentina",
    "goal_count" : "800>",
}
print(info)

# 3) შექმენი dictionary რომლის key იქნება foods ხოლო მნიშვნელობად კი ქართული 
# სუფრის ლისტს მიანიჭებთ მაგალითად ['ხინკალი','მწვადი','ქაბაბი'] თქვენი მიზანია
#  რომ ამ ლისტის მეორე ინდექსი გამოიტანოთ ტერმინალში
georgina_food = {
    "food" : ['ხინკალი','მწვადი','ქაბაბი'] ,
}
print(georgina_food["food"][1])

# 4) შექმენი dictionary სახელად 'movie' რომელსაც ექნება შემდეგი key-ები
# 'title' (ფილმის სახელი)
# 'year' (გამოსვლის წელი)

# შენი მიზანია, რომ კოდის შემდეგ ხაზზე შეცვალო (განაახლო) ფილმის გამოსვლის წელი ახალი წლით და მთლიანი
#  dictionary გამოიტანო ტერმინალში

movie = {
    "title" : "southpaw",
    "year" : 2015,
}
movie["year"] = 2014
print(movie)

# 5) შექმენი dictionary სახელად 'student' სადაც მიანიჭებ:
# 'name': 'შენი სახელი'
# 'age': 18

# შენი მიზანია, რომ ამ ლექსიკონიდან წაშალო ასაკი ('age') 'del' ან '.pop()' მეთოდის გამოყენებით და
#  დარჩენილი dictionary გამოიტანო ტერმინალში
student = {
    "name" : "Demetre",
    "age" : 18,
}

student.pop('age')
print(student)