# 3) დაწერეთ პროგრამა, რომელიც გამოიტანს რიცხვებს 50-დან 200-მდე for loop-ის გამოყენებით.
# 4) დაწერეთ პროგრამა, რომელიც გამოიტანს ყველა ლუწ რიცხვს 1-დან 100-ის ჩათვლით for loop-ის გამოყენებით.
# 5) დაწერეთ პროგრამა, რომელიც გამოიტანს ყველა კენტ რიცხვს 100-დან 150-მდე for loop-ის გამოყენებით.
# 6) დაწერეთ პროგრამა, რომელიც გამოიტანს რიცხვებს 1-დან 50-ის ჩათვლით while loop-ის გამოყენებით.
# 7) დაწერეთ პროგრამა, რომელიც გამოიტანს რიცხვებს 20-დან 60-ის ჩათვლით, 5-ის გამოტოვებით while loop-ის გამოყენებით.
# 8) მომხმარებელს შემოატანინეთ გვარი. გამოიყენეთ For loop-ი იმისთვის, რომ მისი გვარის თითოეული ასო ცალცალკე გამოიტანოთ ტერმინალში.
# 9) დაწერეთ წვენის გაყიდვის პროგრამა სუპერმარკეტისთვის:
# ჩათვალეთ წვენების საწყისი რაოდენობა არის 300. თითოეული მომხმარებელი მარკეტში შემოსვლისას ყიდულობს 2 წვენს.
#  პროგრამამ უნდა გამოიტანოს "You have bought the drink" და გვერდზე მარაგში დარჩენილი წვენების რაოდენობა.
#  როდესა მარაგი ამოიწურება - ტერმინალში და უბეჭდოს "Out of stock".
# 10) დაწერეთ For loop-ის პროგრამა, რომელიც 50-დან 20-მდე გამოიტანს რიცხვებს 3-3 რიცხვის გამოკლებით.
# 11) დაწერეთ While loop_ის პროგრამა, რომელიც 150-დან 0-მდე გამოიტანს ყველა რიცხვს.
# 12) თქვენი სიტყვებით დაწვრილებით ახსენით, თუ როგორ მუშაობს For loop.
# 13) თქვენი სიტყვებით დაწვრილებით ახსენით, თუ როგორ მუშაობს While loop. რატომ სჭირდება While loop-ს counter 
# ცვლადი და რატომ ვცვლით მის მნიშვნელობას ყოველ იტერაციაზე?
# მოცემული დავალებების შესასრულებლად გამოიყენეთ მხოლოდ აქამდე ნასწავლი მასალა❗


#3
for i in range(50 , 201):
    print(i)

#4
for i in range (2, 101, 2):
    print(i)

#5
for i in range (101, 151, 2):
    print(i)

#6
i=1
while i<=50:
    print(i)
    i+=1

7
i=20
while i<=60:
    print(i)
    i+=5

8
surname=(input("enter your name: "))
for i in surname :
    print(i)

9
stock=300
while stock > 0 :
    print("You have bought the drink" )
    stock-=2
    print("left" ,stock)

print("out of stock")

10
i=50
for i in range(50, 20, -3):
    print(i)

11
i=150
while i >= 0:
    print(i)
    i-=1

#12
#For loop ანუ for ციკლი გამოიყენება იმისთვის, რომ გავიმეოროთ კონკრეტული ქმედება
# ჩვენ ვუთითებთ სერიას ან რიცხვების რიგს (range(), სტრინგი).
# ციკლი შლის ამ სერიას ელემენტ-ელემენტად.
# როცა სერია სრულდება, ციკლი წყდება.

#13
#For loop გამოიყენება იმისთვის, რომ გავიმეოროთ რაღაც კონკრეტული რაოდენობით.






