// 2) დაწერეთ პროგრამა while ციკლის გამოყენებით, რომელიც დაბეჭდავს რიცხვებს 1-დან 10-მდე.

let num = 0

while(num <+ 10){
    console.log(num)
    num++
}


// 3) შექმენით while ციკლი, რომელიც გამოითვლის 1-დან 100-მდე რიცხვების ჯამს.

let num1 = 1;
let num2= 0
while(num1 <= 100){
    num2 = num2 + num1;
    num1++
}

console.log(num2)

// 4) დაწერეთ პროგრამა, რომელიც while ციკლის მეშვეობით დაბეჭდავს რაიმე რიცხვის გამრავლების ტაბულას 10-მდე.

let num3 = 3;
let num4 = 0;
let sum = 0;
while( num4 <= 10){
    sum = num3 * num4
    console.log(sum);
    num4 ++
}


// 5) while ციკლის გამოყენებით იპოვეთ და დაბეჭდეთ მასივში არსებული ყველა ლუწი რიცხვი.

let numbers = [2,3,4,5,6,7,8,9,22,33,55,127,44]
let numbers1= []
i= 0;

while(i <numbers.length){
    if (numbers[i] % 2 === 0){
        numbers1.push(numbers[i])
    }
    i++
}

console.log(numbers1)

// 6) დაწერეთ while ციკლი, რომელიც შეამოწმებს შეყვანილ პაროლს — ციკლი უნდა გაგრძელდეს მანამ, სანამ მომხმარებელი არ შეიყვანს სწორ პაროლს.


// 7) while ციკლის გამოყენებით დაბეჭდეთ რიცხვების მასივის თითოეული ელემენტი გამრავლებული ორზე.

let numbers3 = [2, 3, 4, 5, 6, 7, 8, 9, 22, 33, 55, 127, 44];
let i = 0;

while (i < numbers3.length) {
  console.log(numbers3[i] * 2);
  i++;
}

// 8) while ციკლის გამოყენებით დაბეჭდეთ რიცხვების მასივიდან თითოეული ელემენტის ნაშთი 3-ზე გაყოფისას.

let numbers4 = [2, 3, 4, 5, 6, 7, 8, 9, 22, 33, 55, 127, 44];
let j = 0;

while (i < numbers4.length) {
  console.log(numbers4[j] % 3);
  j++;
}


// 9) Nested Loops-ის გამოყენებით დაბეჭდეთ ვარსკვლავებისგან (*) შემდგარი 5x5 კვადრატი.

// 10) Nested Loops-ის გამოყენებით დაბეჭდეთ გამრავლების სრული ტაბულა 1-დან 10-მდე.


// 11) Nested Loops-ის გამოყენებით შეამოწმეთ ორი მასივი და დაბეჭდეთ მათი საერთო ელემენტები.

let array1 = [1, 3, 5, 7, 9, 12];
let array2 = [2, 5, 8, 9, 12, 15];

for (let i = 0; i < array1.length; i++) {
  for (let j = 0; j < array2.length; j++) {
    if (array1[i] === array2[j]) {
      console.log(array1[i]);
    }
  }
}

// 12) დაწერეთ ორი ჩაშენებული ციკლი, რომლებიც იპოვიან ორზომილებიან მასივში (მატრიცაში) არსებული ყველა ელემენტის ჯამს.