// 2) კომენტარის სახით დაწერეთ თუ რა განსხვავებაა let-სა და const keyword-ებს შორის. მოიყვანეთ მაგალითი, 
// თუ რა შემთხვევებში გამოაქვს ჯავასკრიპტს ერორი ცვლადების შექმნისას.

//let ქივორდის შეცვა შეგვიძლია, ხოლო const ქივორდს ვერ შევცვლით
// const name = 'demetre'
// name = "Beridze"
// console.log(name)
// 3) შექმენით 2 სხვადასხვა ცვლადი. მათ შესაქმნელად გამოიყენეთ camelCase. 
// ცვლადები გამოიტანეთ კონსოლში და დააკვირდით მათ მნიშვნელობებს. შემდეგ მიანიჭეთ ამ ცვლადებს თვქნთის
//  სასურველი მნიშვნელობები და თავიდან გამოიტანეთ კონსოლში.

let numOfSlices = 3;
let favouriteFood = "Pizza"
console.log(numOfSlices)
console.log(favouriteFood)

// 4) შექმენით 3 ცვლადი const-ის გამოყენებით. პირველ ცვლადში 
// - ქვეყნის დასახელება, მეორე ცვლადში - დედაქალაქის დასახელება, მესამე ცვლადში კი - ქალაქის დასახელება შეინახეთ. სამივე ცვლადი ერთ ხაზზე დაბეჭდეთ კონსოლში. 

const country = 'Georgia';
const mainCity = 'Tbilisi'
const city = 'Batumi';

// 5) მოიფიქრეთ გზა რომ გამოიტანოთ კონსოლში undefined, ისე რომ თვითონ unefined არ არ დაბეჭდოთ

let name;
console.log(name)