// 2) ახსენით როგორ მუშაობს for loop-ი. ასევე, დაწერეთ რამდენი არგუმენტი გადაეცემა 
// მას და თითოეული არგუმენტი რას ასრულებს?

//for loop ს გადაეცემა 3 არგუმენტი: 1- ლუპის დაწყების არგუმენტი, 2- ლუპის დასრულების არგუმენტი , 3 - მოქმედება

// 3) დაწერეთ for loop-ი, რომელიც რიცხვებს დაითვლის 25-დან 30-მდე.

for(let i =20; i<30; i++ ){
    console.log(i)
}

console.log("")

// 4) დაწერეთ for loop-ი, რომელიც რიცხვებს დაითვლის 90-დან 102-ის ჩათვლით, 2-2 რიცხვის გამოტოვებით.

for(let i = 90; i<102; i+=3){
    console.log(i)
}

console.log("")
// 5) დაწერეთ for loop-ი, რომელიც რიცხვებს 90-დან 50-მდე დაითვლის.

for(let i = 90; i>50; i--){
    console.log(i)
}
console.log("")

// 6) დაწერეთ for loop-ი, რომელიც რიცხვებს 45-დან 20-მდე დაითვლის, 5-5 რიცხვის გამოკლებით.

for(let i = 45; i>20; i-=5){
    console.log(i)
}
console.log("")

// 7) შექმენით ცვლადი და შეინახეთ მასში თქვენი სახელი. გადაუარეთ for loop-ით ისე,
//  რომ სტრინგის ყველა სიმბოლო და თითოეულის ინდექსი ერთად დალოგოთ კონსოლში.

let name1 = "Demetre"
for(let i = 0; i < name1.length; i++){
    console.log(`${i} - ${name1[i]}`)
}

console.log("")

// 8) ახსენი, თუ რა მნიშვნელობა აქვს stopping condition-ის ადგილას length კუთვნილების გამოყენებას, 
// for loop-ის სტრინგზე/მასივზე გადავლისას.



// 9) დაწერეთ for loop-ი, რომელიც რიხცვების სიას გადაუვლის და მსგავს ფორმატში გამოიტანს:
//  'Number: {x}'

let Name = [11,22,333,444,555]

for(let x= 0; x <Name.length; x++){
    console.log(`Name: ${Name[x]}`)
}