// 1) შექმენით თქვენი საყვარელი ფილმების მასივი. გქონდეთ მინიმუმ 3 ელემენტი. ჩაანაცვლეთ მე-2 ელემენტი
//  ისეთი ფილმით, რომელიც არ გიყვართ.

let movies = ["se7en", "hail mary", "treasure planet"]
movies[1] = "8MM";


// 2) შექმენით მასივი, რომელშიც მინიმუმ 5 ხილის სახელწოდებას ჩაწერთ. ჯერ გამოიტანეთ სიის სიგრძე, 
// შემდეგ კი მთლიანი სია კონსოლში.

let fruits = ["apple", "banana", "ananas", "pinaple", "mango"];
console.log(fruits.length);
console.log(fruits)



// 3) შექმენით რიცხვების მასივი, მინუმუმ 10 ელემენტით. ჩაანაცვლეთ მე-5 ელემენტი რიცხვის სიუტყვიერი ვერსიით.
//  (მაგ. თუ სიაში გქონდათ 9 => 'Nine']. 
//  იგივნაირად ჩაანაცვლეთ ბოლო ელემენტი და გამოიტანეთ მთლიანი სია კონსოლში.

let numbers = [1,2,3,4,5,6,7,8,9,10];
numbers[4] = "five";
numbers[9]= "ten";
console.log(numbers)